// 23.4.1 (золото, серебро, медь) написать операторы сложения и вычитания игровой валюты 
let (.+.) x y =
    let (g1, s1, c1) = x
    let (g2, s2, c2) = y
    let c = (c1 + c2) % 12
    let s = (s1 + s2 + (c1 + c2) / 12) % 20
    let g = g1 + g2 + (s1 + s2 + (c1 + c2) / 12) / 20
    (g, s, c)

printfn " Золото Серебро Медь \n 1 Золото = 20 Серебряных\n 1 Серебряный = 12 Медяков"
printfn " Игровой баланс: %A + %A = %A" (5, 6, 12) (1, 20, 7) ((5, 6, 12) .+. (1, 20, 7))

let (.-.) x y = 
    let (g1, s1, c1) = x
    let (g2, s2, c2) = y
    let c = c1 - c2
    let s = s1 - s2
    let g = (g1 - g2) > 0 
    (g,s,c)

// 23.4.2 Арифметические операции с комплексными числами
let (.+) x y = 
//let (.-) x y = 
//let (.*) x y = 
//let (./) x y = 

System.Console.ReadKey();